<center>
<img src="../../img/ods_stickers.jpg" />
    
## [mlcourse.ai](https://mlcourse.ai) â€“ Open Machine Learning Course 
Author: Arina Lopukhova (@erynn). Edited by [Yury Kashnitskiy](https://yorko.github.io) (@yorko) and Vadim Shestopalov (@vchulski). This material is subject to the terms and conditions of the [Creative Commons CC BY-NC-SA 4.0](https://creativecommons.org/licenses/by-nc-sa/4.0/) license. Free use is permitted for any non-commercial purpose.

# <center>Assignment #1. Fall 2019
## <center>Exploratory data analysis of Olympic games with Pandas
    
<img src='../../img/olympic_logo.png' width=50%>

Prior to working on the assignment, you'd better check out the corresponding course material:
 - [Exploratory data analysis with Pandas](https://nbviewer.jupyter.org/github/Yorko/mlcourse_open/blob/master/jupyter_english/topic01_pandas_data_analysis/topic1_pandas_data_analysis.ipynb?flush_cache=true), the same as an interactive web-based [Kaggle Kernel](https://www.kaggle.com/kashnitsky/topic-1-exploratory-data-analysis-with-pandas)
 - first lectures in mlcourse.ai [YouTube playlist ](https://www.youtube.com/watch?v=QKTuw4PNOsU&list=PLVlY_7IJCMJeRfZ68eVfEcu-UcN9BbwiX) 
 - you can also practice with demo assignments, which are simpler and already shared with solutions: [A1 demo](https://www.kaggle.com/kashnitsky/a1-demo-pandas-and-uci-adult-dataset), [solution](https://www.kaggle.com/kashnitsky/a1-demo-pandas-and-uci-adult-dataset-solution)

### Your task is to:
 1. write code and perform computations in the cells below
 2. choose answers in the [webform](https://docs.google.com/forms/d/1JxhQ9Bg4OpM3E5N47ZuRbILgDuMRbvEnUbDMZK8L-NU). Solutions will be shared only with those who've filled in this form 
 3. submit answers with some email and **remember it**! This will be your ID during the course. Specify your real full name in the form as well (no nicks allowed in the final top-100 [rating](https://mlcourse.ai/rating)). If in doubt, you can re-submit the form till the deadline for A1, no problem, but stick to only one email.
 
### <center> Deadline for A1: 2019 September 15, 20:59 GMT (London time)
    
You'll get up to 10 credits for this assignment.

### How to get help
In [ODS Slack](https://opendatascience.slack.com) (if you still don't have access, fill in the [form](https://docs.google.com/forms/d/10HAN5huM996snUKjsNYyT_oOlm2uOsTKulKurb3oiNM/) mentioned on the mlcourse.ai main page), we have a channel **#mlcourse_ai_news** with announcements from the course team.
You can discuss the course content freely in the **#mlcourse_ai** channel (we still have a huge Russian-speaking group, they have a separate channel **#mlcourse_ai_rus**).

Here's how you reply in a thread (press this dialog icon to drill down into a thread):

<img src="../../img/start_a_thread.png" />

Please stick to special threads *a1_q1-5_fall2019* and *a1_q6-10_fall2019* in **#mlcourse_ai_news** for your questions on A1. Help each other without sharing correct code and answers. Our TA **Vadim @vchulski** is there to help (only in the mentioned thread, do not write to him directly).

Lastly, you can save useful messages by pinning them, further you can find pinned items on the top, just below the channel name:

<img src="../../img/pinned_item.png" />

### Assignment 
__There are ten questions about 120 years of Olympic history in this task. Your task is to fill in the missing Python code and choose answers in [this web-form](https://docs.google.com/forms/d/1JxhQ9Bg4OpM3E5N47ZuRbILgDuMRbvEnUbDMZK8L-NU).__

Download the file `athlete_events.csv` from [here](https://drive.google.com/file/d/1f5v6Z2ayc7h698FG_98wP5x1Y2zZQeox/view?usp=sharing) (scraped by [rgriffin](https://www.randigriffin.com/) from www.sports-reference.com). The dataset has the following features:

- __ID__ - Unique number for each athlete
- __Name__ - Athlete's name
- __Sex__ - M or F
- __Age__ - Integer
- __Height__ - In centimeters
- __Weight__ - In kilograms
- __Team__ - Team name
- __NOC__ - National Olympic Committee 3-letter code
- __Games__ - Year and season
- __Year__ - Integer
- __Season__ - Summer or Winter
- __City__ - Host city
- __Sport__ - Sport
- __Event__ - Event
- __Medal__ - Gold, Silver, Bronze, or NA

In [152]:
import pandas as pd

In [153]:
# Change the path to the dataset file if needed. 
PATH = "C:/Users/canat/Downloads/Telegram Desktop/athlete_events.csv"

In [154]:
data = pd.read_csv(PATH)
data.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

__1. How old were the youngest male and female participants of the 1992 Olympics?__

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q1-5_fall2019*

- 16 and 15
- 14 and 13 
- 13 and 11
- 11 and 12

In [64]:
#1.yol 
#import pandas as pd
#PATH="C:/Users/canat/Downloads/Telegram Desktop/athlete_events.csv"
#data = pd.read_csv(PATH)
#data.head()
import numpy as np
df=pd.DataFrame(data)
ozel=df[["Year","Age","Sex"]]
sort_by_life = ozel.sort_values('Age',ascending=True)
year=sort_by_life[sort_by_life["Year"]==1992]
print(year.head(2))
#print(year)
#2. yol
data[data.Year == 1992].groupby(by=['Sex'],as_index=False)['Age'].min()

        Year   Age Sex
73461   1992  11.0   M
120233  1992  12.0   F

  Sex   Age
0   F  12.0
1   M  11.0

__2. What was the percentage of male basketball players among all the male participants of the 2012 Olympics? Round the answer to the first decimal.__

*Hint:* here and further if needed drop duplicated sportsmen to count only unique ones. 

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q1-5_fall2019*

- 0.2
- 1.5 
- 2.5
- 7.7

In [69]:
columns_disi = ['ID','Name','Sex','Sport','Year','Height']
data_bas=data.loc[(data.Year==2012)&(data.Sex=='M')&(data.Sport=='Basketball'),columns_disi].drop_duplicates()
data_bas.head()
#data_new.pct_change(axis='columns')

        ID                       Name Sex       Sport  Year  Height
1186   664       Kieron Robert Achara   M  Basketball  2012   208.0
6119  3444     Al-Farouq Ajiede Aminu   M  Basketball  2012   211.0
6120  3445  Abdul Wahab "Alade" Aminu   M  Basketball  2012   210.0
6631  3711        David Emil Andersen   M  Basketball  2012   211.0
8166  4505       Carmelo Kyan Anthony   M  Basketball  2012   203.0

In [70]:
data_full=data.loc[(data.Sex=="M") & (data.Year==2012),columns_disi].drop_duplicates()
data_full.head()

     ID                                Name Sex      Sport  Year  Height
1     2                            A Lamusi   M       Judo  2012   170.0
98   34  Jamale (Djamel-) Aarrass (Ahrass-)   M  Athletics  2012   187.0
134  48                    Abdelhak Aatakni   M     Boxing  2012     NaN
174  73                           Luc Abalo   M   Handball  2012   182.0
197  91                      Emanuele Abate   M  Athletics  2012   190.0

In [71]:
data_full.count(axis=1)

1         6
98        6
134       5
174       6
197       6
216       6
249       6
255       6
290       6
422       6
427       6
434       6
436       6
449       6
454       6
469       6
479       6
556       5
588       6
598       6
599       6
608       6
612       6
618       6
660       6
733       6
758       6
788       6
859       6
861       6
         ..
269791    6
269913    6
269946    6
270037    6
270098    6
270105    6
270132    6
270162    6
270169    6
270303    6
270325    6
270369    6
270434    6
270440    6
270451    6
270452    6
270583    6
270590    6
270596    6
270642    6
270677    6
270719    6
270720    6
270802    6
270983    6
271004    6
271020    6
271023    6
271090    6
271091    6
Length: 5863, dtype: int64

In [72]:
bass_count=len(data_bas.index)

In [73]:
full_count =len(data_full.index)

In [74]:
bass_int = int(bass_count)

In [75]:
full_int = int(full_count)

In [76]:
last =(bass_int/full_int)*100

In [77]:
print(last)

2.4560805048609926

__3. What are the mean and standard deviation of height for female tennis players who participated in the 2000 Olympics? Round the answer to the first decimal.__

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q1-5_fall2019*

- 171.8 and 6.5
- 179.4 and 10
- 180.7 and 6.7
- 182.4 and 9.1

In [58]:
columns_person = ['ID','Name','Sex','Height','Weight','NOC',"Sport","Year"]
data_new = data.loc[(data.Year == 2000)&(data.Sex == 'F')&(data.Sport == 'Tennis'), columns_person].drop_duplicates()
data_new.head()
standart=data_new.loc[:,"Height"].std()
standart2=data_new.loc[:,"Height"].mean()
print(standart,standart2)

6.563321899569362 171.8068181818182

__4. Find a sportsman who participated in the 2006 Olympics, with the highest weight among other participants of the same Olympics. What sport did he or she do?__

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q1-5_fall2019*

- Judo
- Bobsleigh 
- Skeleton
- Boxing

In [18]:
a=data[data.Year==2006].groupby(by=["Sport"],as_index=False)['Weight'].max()
b=a.sort_values("Weight",ascending=False)
print(b.head(1))

       Sport  Weight
11  Skeleton   127.0

__5. How many times did John Aalberg participate in the Olympics held in different years?__

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q1-5_fall2019*

- 0
- 1 
- 2
- 3

In [78]:
#1.yol
import pandas as pd
PATH="C:/Users/canat/Downloads/Telegram Desktop/athlete_events.csv"
data = pd.read_csv(PATH)
data.head()
import numpy as np
df=pd.DataFrame(data)
#print(data)
dat=df[df.Name=="John Aalberg"]
print(dat)
#2.yol
dat2=data.loc[data.Name == 'John Aalbergs'].Year.nunique()
print(dat2)

    ID          Name Sex   Age  Height  Weight           Team  NOC  \
18   7  John Aalberg   M  31.0   183.0    72.0  United States  USA
19   7  John Aalberg   M  31.0   183.0    72.0  United States  USA
20   7  John Aalberg   M  31.0   183.0    72.0  United States  USA
21   7  John Aalberg   M  31.0   183.0    72.0  United States  USA
22   7  John Aalberg   M  33.0   183.0    72.0  United States  USA
23   7  John Aalberg   M  33.0   183.0    72.0  United States  USA
24   7  John Aalberg   M  33.0   183.0    72.0  United States  USA
25   7  John Aalberg   M  33.0   183.0    72.0  United States  USA

          Games  Year  Season         City                 Sport  \
18  1992 Winter  1992  Winter  Albertville  Cross Country Skiing
19  1992 Winter  1992  Winter  Albertville  Cross Country Skiing
20  1992 Winter  1992  Winter  Albertville  Cross Country Skiing
21  1992 Winter  1992  Winter  Albertville  Cross Country Skiing
22  1994 Winter  1994  Winter  Lillehammer  Cross Country Skiing
23  1994 Winter  1994  Winter  Lillehammer  Cross Country Skiing
24  1994 Winter  1994  Winter  Lillehammer  Cross Country Skiing
25  1994 Winter  1994  Winter  Lillehammer  Cross Country Skiing

                                                Event Medal
18           Cross Country Skiing Men's 10 kilometres   NaN
19           Cross Country Skiing Men's 50 kilometres   NaN
20  Cross Country Skiing Men's 10/15 kilometres Pu...   NaN
21  Cross Country Skiing Men's 4 x 10 kilometres R...   NaN
22           Cross Country Skiing Men's 10 kilometres   NaN
23           Cross Country Skiing Men's 30 kilometres   NaN
24  Cross Country Skiing Men's 10/15 kilometres Pu...   NaN
25  Cross Country Skiing Men's 4 x 10 kilometres R...   NaN
0

__6. How many gold medals in tennis did sportspeople from the Switzerland team win at the 2008 Olympics? Count every medal from every sportsperson.__

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q6-10_fall2019*

- 0
- 1 
- 2
- 3

In [79]:
dat2=data.loc[(data.Team == 'Switzerland')&(data.Sport=='Tennis')&(data.Medal=='Gold')&(data.Year==2008)].Year.nunique()

In [80]:
print(dat2)

1

__7. Is it true that Spain won fewer medals than Italy at the 2016 Olympics? Do not consider NaN values in _Medal_ column.__ 

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q6-10_fall2019*

- Yes
- No

In [81]:
def n_medal(country): 
    print(country,':',data[(data.Year==2016)&(data.Team==country)&(data.Medal.notnull())]['Medal'].count())

In [82]:
n_medal('Spain')
n_medal('Italy')

Spain : 43
Italy : 70

In [ ]:
#no

__8. What age category did the fewest and the most participants of the 2008 Olympics belong to?__

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q6-10_fall2019*

- [45-55] and [25-35) correspondingly
- [45-55] and [15-25) correspondingly
- [35-45) and [25-35) correspondingly
- [45-55] and [35-45) correspondingly

In [89]:
data[(data.Year==2008)]["Age"].describe()

count    13600.000000
mean        25.734118
std          5.685902
min         12.000000
25%         22.000000
50%         25.000000
75%         29.000000
max         67.000000
Name: Age, dtype: float64

In [90]:
pd.cut(data.loc[(data.Year==2008),['ID','Age']]['Age'],bins = 4,duplicates='drop',right=False).value_counts()

[12.0, 25.75)      7369
[25.75, 39.5)      5915
[39.5, 53.25)       298
[53.25, 67.055)      18
Name: Age, dtype: int64

In [91]:
pd.cut(data.loc[(data.Year==2008),['ID','Age']].drop_duplicates()['Age'],bins = 4,duplicates='drop',right=False).value_counts()

[12.0, 25.75)      5677
[25.75, 39.5)      5001
[39.5, 53.25)       208
[53.25, 67.055)      12
Name: Age, dtype: int64

__9. Is it true that there were Summer Olympics held in Atlanta? Is it true that there were Winter Olympics held in Squaw Valley?__

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q6-10_fall2019*

- Yes, Yes
- Yes, No
- No, Yes 
- No, No

In [169]:
data=data.loc[(data.Season=="Summer")&(data.City=="Atlanta"),['City','Year','Season']].drop_duplicates()

In [170]:
data

Empty DataFrame
Columns: [City, Year, Season]
Index: []

In [ ]:
#yes

In [155]:
data=data.loc[(data.Season=="Winter")&(data.City=="Squaw Valley"),['City','Year','Season']].drop_duplicates()

In [156]:
data

            City  Year  Season
83  Squaw Valley  1960  Winter

In [ ]:
#yes

In [ ]:
#2.yol

In [157]:
def Olympics(city): 
    return(data.loc[(data.City==city),['City','Year','Season']].drop_duplicates())

In [160]:
Olympics('Atlanta')

Empty DataFrame
Columns: [City, Year, Season]
Index: []

In [159]:
Olympics('Squaw Valley')

            City  Year  Season
83  Squaw Valley  1960  Winter

__10. What is the absolute difference between the number of unique sports at the 1986 Olympics and 2002 Olympics?__

*For discussions, please stick to [ODS Slack](https://opendatascience.slack.com/), channel #mlcourse_ai_news, pinned thread #a1_q6-10_fall2019*

- 3 
- 10
- 15
- 27

In [167]:
data.groupby(by=['Year','Season'],as_index=False)['ID'].count()

In [164]:
(data[data.Year == 2002]).groupby(by=['Year','Season'],as_index=False)['Sport'].nunique()#unique sports

Empty DataFrame
Columns: [City, Year, Season]
Index: []

In [ ]:
#15

That's it! Now go and do 30 push-ups! :)